TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/dl_aesadv.h
/**
 *  @brief Loads the CBC-MAC second key
 *
 *  Specific to CBC-MAC operation.  Pre-calculated second key to perform a
 *  final XOR operation on the last input data block.
 *
 *  @param[in] aesadv            Pointer to the register overlay for the
 *                               peripheral
 *  @param[in] secondKeyAligned  Pointer to an uint32_t array of length 4
 *                               containing the second key
 *
 *  @sa DL_AESADV_setSecondKey
 */
void DL_AESADV_setSecondKeyAligned(
    AESADV_Regs *aesadv, const uint32_t *secondKeyAligned);

/**
 *  @brief Loads the CBC-MAC third key
 *
 *  Specific to CBC-MAC operation. Pre-calculated third key to perform a
 *  final XOR operation on the last input data block.
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *  @param[in] thirdKey     Pointer to an uint8_t array of length 16 containing
 *                          the third key
 *
 *  @return Status of operation. Operation will fail if not 32-bit aligned. One
 *          of @ref DL_AESADV_STATUS.
 *
 *  @note This function adds additional cycles in order to verify no unaligned
 *        access, if this is not necessary, consider using uint32_t pointers and
 *        @ref DL_AESADV_setThirdKeyAligned
 */
DL_AESADV_STATUS DL_AESADV_setThirdKey(
    AESADV_Regs *aesadv, const uint8_t *thirdKey);

/**
 *  @brief Loads the CBC-MAC third key
 *
 *  Specific to CBC-MAC operation. Pre-calculated third key to perform a
 *  final XOR operation on the last input data block.
 *
 *  @param[in] aesadv           Pointer to the register overlay for the
 *                              peripheral
 *  @param[in] thirdKeyAligned  Pointer to an uint32_t array of length 4
 *                              containing the third key
 *
 *  @sa DL_AESADV_setThirdKey
 */
void DL_AESADV_setThirdKeyAligned(
    AESADV_Regs *aesadv, const uint32_t *thirdKeyAligned);

/**
 *  @brief Loads either zero or an intermediate 128-bit TAG to resume GCM/CCM.
 *
 *  Specific to the GCM/CCM modes. During initialization and beginning of a new
 *  combined operation mode (GCM or CCM only), this must be set to 0. However,
 *  during continuation this tag is part of the saved intermediate digest that
 *  must be restored.
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *  @param[in] tag          Pointer to an uint8_t array of length 16 containing
 *                          zeroes or the intermediate digest
 *
 *  @return Status of operation. Operation will fail if not 32-bit aligned. One
 *          of @ref DL_AESADV_STATUS.
 *
 *  @note This function adds additional cycles in order to verify no unaligned
 *        access, if this is not necessary, consider using uint32_t pointers and
 *        @ref DL_AESADV_loadIntermediateTAGAligned
 */
DL_AESADV_STATUS DL_AESADV_loadIntermediateTAG(
    AESADV_Regs *aesadv, const uint8_t *tag);

/**
 *  @brief Loads either zero or an intermediate 128-bit TAG to resume GCM/CCM.
 *
 *  Specific to the GCM/CCM modes. During initialization and beginning of a new
 *  combined operation mode (GCM or CCM only), this must be set to 0. However,
 *  during continuation this tag is part of the saved intermediate digest that
 *  must be restored.
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *  @param[in] tagAligned   Pointer to an uint32_t array of length 4 containing
 *                          zeroes or the intermediate digest
 *
 *  @sa DL_AESADV_loadIntermediateTAG
 */
void DL_AESADV_loadIntermediateTAGAligned(
    AESADV_Regs *aesadv, const uint32_t *tagAligned);

/**
 *  @brief Loads the 128-bit initialization vector to the AESADV module.
 *
 *  When used with GCM, the upper word iv[127:96] needs to be written with
 *  0x01000000 in order to appropriately mark the initial counter value of 1.
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *  @param[in] iv           Pointer to an uint8_t array of length 16 containing
 *                          the initialization vector
 *
 *  @return Status of operation. Operation will fail if not 32-bit aligned. One
 *          of @ref DL_AESADV_STATUS.
 *
 *  @note  For CCM, this iv must be written with the CCM-specific value A0. This
 *         value consists of the concatenation of A0 flags, the nonce, and the
 *         counter. There is a specialized function that can load this type of
 *         IV found at @ref DL_AESADV_loadCCMNonceAndCounter.
 *
 *  @note This function adds additional cycles in order to verify no unaligned
 *        access, if this is not necessary, consider using uint32_t pointers and
 *        @ref DL_AESADV_loadInitializationVectorAligned
 *
 *  @sa DL_AESADV_loadCCMNonceAndCounter
 */
DL_AESADV_STATUS DL_AESADV_loadInitializationVector(
    AESADV_Regs *aesadv, const uint8_t *iv);

/**
 *  @brief Loads the 128-bit initialization vector to the AESADV module.
 *
 *  When used with GCM, the upper word iv[127:96] needs to be written with
 *  0x01000000 in order to appropriately mark the initial counter value of 1.
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *  @param[in] ivAligned    Pointer to an uint32_t array of length 4 containing
 *                          the initialization vector
 *
 *  @note  For CCM, this iv must be written with the CCM-specific value A0. This
 *         value consists of the concatenation of A0 flags, the nonce, and the
 *         counter. There is a specialized function that can load this type of
 *         IV found at @ref DL_AESADV_loadCCMNonceAndCounter.
 *
 *  @sa DL_AESADV_loadCCMNonceAndCounter
 *  @sa DL_AESADV_loadInitializationVector
 */
void DL_AESADV_loadInitializationVectorAligned(
    AESADV_Regs *aesadv, const uint32_t *ivAligned);

/**
 *  @brief Reads the 128-bit initialization vector from the AES Module
 *
 *  Contains the latest 128-bit initialization vector output from the engine.
 *
 *  @param[in] aesadv        Pointer to the register overlay for the
 *                           peripheral
 *
 *  @param[out] iv           Pointer to an uint8_t array of length 16 where the
 *                           iv will be written
 *
 *  @return Status of operation. Operation will fail if not 32-bit aligned. One
 *          of @ref DL_AESADV_STATUS.
 *
 *  @note This function adds additional cycles in order to verify no unaligned
 *        access, if this is not necessary, consider using uint32_t pointers and
 *        @ref DL_AESADV_readInitializationVectorAligned
 */
DL_AESADV_STATUS DL_AESADV_readInitializationVector(
    AESADV_Regs *aesadv, const uint8_t *iv);

/**
 *  @brief Reads the 128-bit initialization vector from the AES Module
 *
 *  Contains the latest 128-bit initialization vector output from the engine.
 *
 *  @param[in] aesadv        Pointer to the register overlay for the
 *                           peripheral
 *
 *  @param[out] ivAligned    Pointer to an uint32_t array of length 4 where the
 *                           iv will be written
 *
 *  @sa DL_AESADV_readInitializationVector
 */
void DL_AESADV_readInitializationVectorAligned(
    AESADV_Regs *aesadv, uint32_t *ivAligned);

/**
 *  @brief Loads the CCM Nonce And Counter IV, also called A0
 *
 *  CCM-Specific use of the IV field called A0. The A0 field is formatted
 *  as follows:
 *
 *  LSB                                                                   MSB
 *  (5'b00000 concat 3'b counterWidth - 1) | Nonce | Counter IV (always 0's)
 *
 *  the counter width is set as one of DL_AESADV_CCM_CTR_WIDTH (equal to
 *  counterWidth -1).
 *      For example, a 5-byte width for the counter (and thus the data payload
 *  width) will correspond to a Counter IV of 40-bits. The counter width taking
 *  8 bits, and the Nonce taking the remaining 80-bits (10 bytes).
 *      An 8-byte counter width would yield a counter IV width of 64-bits with a
 *  Nonce taking the remaining 54-bits (7 bytes). The LSB of the IV will then
 *  be 8'b00000111 or 0x07 (one less than the byte width)
 *      Thus, the Nonce should be sufficiently wide to fit the bits that are
 *  remaining for the nonce, and this will vary with the counter field width
 *  provided. The LSB of the IV will be 0x04 (one less than the byte width)
 *
 *  The following table describes the Nonce array lengths that should be used:
 *
 *  DL_AESADV_CCM_CTR_WIDTH (bytes) | Nonce Array Length Required (bytes)
 *  --------------------------------|-------------------------------------
 *              2                   |                13
 *              3                   |                12
 *              4                   |                11
 *              5                   |                10
 *              6                   |                 9
 *              7                   |                 8
 *              8                   |                 7
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *  @param[in] nonce        Pointer to the uint8_t nonce Value for CCM, should
 *                          be unique and length calculated as above.
 *  @param[in] ctrWidth     Counter Width. One of @ref DL_AESADV_CCM_CTR_WIDTH.
 *                          Should match width provided in control register.
 *
 *  @note During halting and resumption of CCM operations, it is required to use
 *        the @ref DL_AESADV_loadInitializationVector and
 *        @ref DL_AESADV_readInitializationVector functions as this preserves
 *        the current counter state. This function is designed for
 *        initialization of the operation only.
 *
 *  @sa DL_AESADV_loadInitializationVector
 *  @sa DL_AESADV_readInitializationVector
 */
void DL_AESADV_loadCCMNonceAndCounter(
    AESADV_Regs *aesadv, uint8_t *nonce, DL_AESADV_CCM_CTR_WIDTH ctrWidth);

/**
 *  @brief loads 128 bits (4 words) of input data
 *
 *  Loads the next 128 bits of input data. Either AAD (GCM/CCM) or Crypto Data.
 *  If less than 128 bits are left (or if the width of data is less than 128
 *  bits ex. CCM), it is still necessary to pad 0's to the remaining bits in
 *  order for the engine to start the operation.
 *      For GCM/CCM, the last AAD block can have less than 128 bits, and
 *  should be padded with 0's rather than appended to the crypto data.
 *      For authentication modes (GCM, CCM, CBC-MAC), refer to the TRM for
 *  additional information about necessary padding.
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *  @param[in] data         Pointer to uint8_t bit data array of length 16 to
 *                          be inputted.
 *
 *  @return Status of operation. Operation will fail if not 32-bit aligned. One
 *          of @ref DL_AESADV_STATUS.
 *
 *  @note This function adds additional cycles in order to verify no unaligned
 *        access, if this is not necessary, consider using uint32_t pointers and
 *        @ref DL_AESADV_loadInputDataAligned
 *
 *  @sa DL_AESADV_readOutputData
 */
DL_AESADV_STATUS DL_AESADV_loadInputData(
    AESADV_Regs *aesadv, const uint8_t *data);

/**
 *  @brief loads 128 bits (4 words) of input data
 *
 *  Loads the next 128 bits of input data. Either AAD (GCM/CCM) or Crypto Data.
 *  If less than 128 bits are left (or if the width of data is less than 128
 *  bits ex. CCM), it is still necessary to pad 0's to the remaining bits in
 *  order for the engine to start the operation.
 *      For GCM/CCM, the last AAD block can have less than 128 bits, and
 *  should be padded with 0's rather than appended to the crypto data.
 *      For authentication modes (GCM, CCM, CBC-MAC), refer to the TRM for
 *  additional information about necessary padding.
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *  @param[in] dataAligned  Pointer to uint32_t bit data array of length 4 to
 *                          be inputted.
 *
 *  @sa DL_AESADV_loadInputData
 *  @sa DL_AESADV_readOutputDataAligned
 */
void DL_AESADV_loadInputDataAligned(
    AESADV_Regs *aesadv, const uint32_t *dataAligned);

/**
 *  @brief reads 128-bits of output data that has been encrypted/decrypted.
 *
 *  Reads the ciphertext/plaintext outputted by the AESADV module. If less than
 *  128 bits is expected, there still must be 128-bits read, which must mean
 *  the data pointer has at least 128 bits to spare.
 *
 *  Inputting Additional Authentication Data (AAD) will not place any
 *  information into the output buffer, thus a read is not required.
 *
 *  @param[in] aesadv        Pointer to the register overlay for the peripheral
 *  @param[out] data         Pointer to the data that will be read, uint8_t
 *                           requiring length of at least 16 to not overwrite
 *                           other variables.
 *
 *  @return Status of operation. Operation will fail if not 32-bit aligned. One
 *          of @ref DL_AESADV_STATUS.
 *
 *  @note This function adds additional cycles in order to verify no unaligned
 *        access, if this is not necessary, consider using uint32_t pointers and
 *        @ref DL_AESADV_readOutputDataAligned
 */
DL_AESADV_STATUS DL_AESADV_readOutputData(
    const AESADV_Regs *aesadv, const uint8_t *data);

/**
 *  @brief reads 128-bits of output data that has been encrypted/decrypted.
 *
 *  Reads the ciphertext/plaintext outputted by the AESADV module. If less than
 *  128 bits is expected, there still must be 128-bits read, which must mean
 *  the data pointer has at least 128 bits to spare.
 *
 *  Inputting Additional Authentication Data (AAD) will not place any
 *  information into the output buffer, thus a read is not required.
 *
 *  @param[in] aesadv        Pointer to the register overlay for the peripheral
 *  @param[out] dataAligned  Pointer to the data that will be read, uint32_t
 *                           requiring length of at least 4 to not overwrite
 *                           other variables.
 *
 *  @sa DL_AESADV_readOutputData
 */
void DL_AESADV_readOutputDataAligned(
    const AESADV_Regs *aesadv, uint32_t *dataAligned);

/**
 *  @brief reads 128-bit output tag at the conclusion of operation/halt
 *
 *  Specific to authentication-enabled modes. Reads the tag. Only valid at the
 *  conclusion of an operation, or because an operation has been halted and
 *  requires a digest. In the case of a halted operation, the output will be
 *  an intermediate tag for CCM or GCM.
 *
 *  @param[in] aesadv        Pointer to the register overlay for the peripheral
 *  @param[out] tag          Pointer to the tag to be read, a uint8_t array of
 *                           length 16
 *
 *  @return Status of operation. Operation will fail if not 32-bit aligned. One
 *          of @ref DL_AESADV_STATUS.
 *
 *  @note This function adds additional cycles in order to verify no unaligned
 *        access, if this is not necessary, consider using uint32_t pointers and
 *        @ref DL_AESADV_readTAGAligned

 *  @sa DL_AESADV_isSavedOutputContextReady
 */
DL_AESADV_STATUS DL_AESADV_readTAG(
    const AESADV_Regs *aesadv, const uint8_t *tag);

/**
 *  @brief reads 128-bit output tag at the conclusion of operation/halt
 *
 *  Specific to authentication-enabled modes. Reads the tag. Only valid at the
 *  conclusion of an operation, or because an operation has been halted and
 *  requires a digest. In the case of a halted operation, the output will be
 *  an intermediate tag for CCM or GCM.
 *
 *  @param[in] aesadv        Pointer to the register overlay for the peripheral
 *  @param[out] tagAligned   Pointer to the tag to be read, a uint32_t array of
 *                           length 4
 *
 *  @sa DL_AESADV_isSavedOutputContextReady
 */
void DL_AESADV_readTAGAligned(const AESADV_Regs *aesadv, uint32_t *tagAligned);

/**
 *  @brief Forces AESADV to begin processing input data.
 *
 *  This function will validate the input data buffer and force AESADV to begin
 *  processing data. Any value can be used in order to force processing data.
 *
 *  @note To use, @ref DL_AESADV_enableDMAOperation must not be in use
 *
 *  @param[in] aesadv        Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_AESADV_forceInputDataAvailable(AESADV_Regs *aesadv)
{
    aesadv->FORCE_IN_AV = 0x0123CAFE;
}

/**
 *  @brief Set the CCM AAD align data word.
 *
 *  Specific to CCM mode. Writes the alignment data word used to concatenate to
 *  the next block of additional authentication data (AAD). Will need to be set
 *  during initialization or during the resumption of a halted CCM operation.
 *
 *  @param[in] aesadv        Pointer to the register overlay for the peripheral
 *  @param[in] alignWord     AAD alignment word of type uint32_t
 */
__STATIC_INLINE void DL_AESADV_setCCMAlignWord(
    AESADV_Regs *aesadv, uint32_t alignWord)
{
    aesadv->CCM_ALN_WRD = alignWord;
}

/**
 *  @brief Get the CCM AAD align data word.
 *
 *  Specific to CCM mode. Reads the alignment data word used to concatenate to
 *  the next block of additional authentication data (AAD).
 *
 *  @param[in] aesadv        Pointer to the register overlay for the peripheral
 *
 *  @return Current AAD alignment word of type uint32_t
 */
__STATIC_INLINE uint32_t DL_AESADV_getCCMAlignWord(const AESADV_Regs *aesadv)
{
    return (aesadv->CCM_ALN_WRD);
}

/**
 *  @brief Sets the lower 32-bits of the data blocks remaining in an operation
 *
 *  Specific to GCM/CCM mode. The block count is 57-bits and represents the
 *  number of remaining AES cryptographic payload blocks (non-AAD) in an
 *  operation. During an interruption of a GCM/CCM operation, this number needs
 *  to be saved and restored before resumption.
 *
 *  @param[in] aesadv           Pointer to the register overlay for the
 *                              peripheral
 *  @param[in] lowerBlockCount  Lower 32-bits of the overall data blocks
 *                              remaining
 *
 *  @sa DL_AESADV_getLowerBlockCount
 *  @sa DL_AESADV_setUpperBlockCount
 */
__STATIC_INLINE void DL_AESADV_setLowerBlockCount(
    AESADV_Regs *aesadv, uint32_t lowerBlockCount)
{
    aesadv->BLK_CNT0 = lowerBlockCount;
}

/**
 *  @brief Gets the lower 32-bits of the data blocks remaining in an operation
 *
 *  Specific to GCM/CCM mode. The block count is 57-bits and represents the
 *  number of remaining AES cryptographic payload blocks (non-AAD) in an
 *  operation. During an interruption of a GCM/CCM operation, this number needs
 *  to be saved and restored before resumption.
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *
 *  @return Lower 32-bits of overall data blocks remaining
 *
 *  @sa DL_AESADV_setLowerBlockCount
 */
__STATIC_INLINE uint32_t DL_AESADV_getLowerBlockCount(
    const AESADV_Regs *aesadv)
{
    return aesadv->BLK_CNT0;
}

/**
 *  @brief Sets the upper 25-bits of the data blocks remaining in an operation
 *
 *  Specific to GCM/CCM mode. The block count is 57-bits and represents the
 *  number of remaining AES cryptographic payload blocks (non-AAD) in an
 *  operation. During an interruption of a GCM/CCM operation, this number needs
 *  to be saved and restored before resumption.
 *
 *  @param[in] aesadv           Pointer to the register overlay for the
 *                              peripheral
 *  @param[in] upperBlockCount  Upper 25-bits of the overall data blocks
 *                              remaining (bits [25:31] are ignored)
 *
 *  @sa DL_AESADV_getUpperBlockCount
 *  @sa DL_AESADV_setLowerBlockCount
 */
__STATIC_INLINE void DL_AESADV_setUpperBlockCount(
    AESADV_Regs *aesadv, uint32_t upperBlockCount)
{
    aesadv->BLK_CNT1 = (upperBlockCount & 0x01FFFFFFU);
}

/**
 *  @brief Gets the upper 25-bits of the data blocks remaining in an operation
 *
 *  Specific to GCM/CCM mode. The block count is 57-bits and represents the
 *  number of remaining AES cryptographic payload blocks (non-AAD) in an
 *  operation. During an interruption of a GCM/CCM operation, this number needs
 *  to be saved and restored before resumption.
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *
 *  @return Upper 25-bits of overall data blocks remaining (bits [25:31] are 0)
 *
 *  @sa DL_AESADV_setUpperBlockCount
 */
__STATIC_INLINE uint32_t DL_AESADV_getUpperBlockCount(
    const AESADV_Regs *aesadv)
{
    return (aesadv->BLK_CNT1 & 0x01FFFFFFU);
}

/**
 *  @brief      Enable AESADV interrupts
 *
 *  @param[in]  aesadv        Pointer to the register overlay for the peripheral
 *  @param[in]  interruptMask Bit mask of interrupts to enable. Bitwise OR of
 *                            @ref DL_AESADV_INTERRUPT
 */
__STATIC_INLINE void DL_AESADV_enableInterrupt(
    AESADV_Regs *aesadv, uint32_t interruptMask)
{
    aesadv->CPU_INT.IMASK |= interruptMask;
}

/**
 *  @brief      Disable AESADV interrupts
 *
 *  @param[in]  aesadv         Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to enable. Bitwise OR of
 *                             @ref DL_AESADV_INTERRUPT
 */
__STATIC_INLINE void DL_AESADV_disableInterrupt(
    AESADV_Regs *aesadv, uint32_t interruptMask)
{
    aesadv->CPU_INT.IMASK &= ~(interruptMask);
}

/**
 *  @brief      Check if AES Ready interrupt is enabled
 *
 *  @param[in]  aesadv         Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_AESADV_INTERRUPT
 *
 *  @return     Which of the requested AESADV interrupts are enabled
 *
 *  @retval     Bitwise OR of @ref DL_AESADV_INTERRUPT values
 */
__STATIC_INLINE uint32_t DL_AESADV_getEnabledInterrupts(
    const AESADV_Regs *aesadv, uint32_t interruptMask)
{
    return (aesadv->CPU_INT.IMASK & interruptMask);
}

/**
 *  @brief      Check interrupt flag of enabled AESADV interrupts
 *
 *  Checks if any of the AESADV interrupts that was previously enabled are
 *  pending.
 *
 *  @param[in]  aesadv         Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_AESADV_INTERRUPT
 *
 *  @return     Which of the requested and enabled AESADV interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_AESADV_INTERRUPT
 *
 *  @sa         DL_AESADV_enableInterrupt
 */
__STATIC_INLINE uint32_t DL_AESADV_getEnabledInterruptStatus(
    const AESADV_Regs *aesadv, uint32_t interruptMask)
{
    return (aesadv->CPU_INT.MIS & interruptMask);
}

/**
 *  @brief      Check interrupt flag of any AESADV interrupts
 *
 *  Checks if any of the AESADV interrupts are pending. Interrupts do not have
 *  to be previously enabled.
 *
 *  @param[in]  aesadv         Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_AESADV_INTERRUPT
 *
 *  @return     Which of the requested AESADV interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_AESADV_INTERRUPT
 */
__STATIC_INLINE uint32_t DL_AESADV_getRawInterruptStatus(
    const AESADV_Regs *aesadv, uint32_t interruptMask)
{
    return (aesadv->CPU_INT.RIS & interruptMask);
}

/**
 *  @brief      Get highest priority pending AESADV interrupt
 *
 *  Checks if any AESADV interrupts are pending. Interrupt does not have to
 *  be previously enabled.
 *
 *  @param[in]  aesadv      Pointer to the register overlay for the peripheral
 *
 *  @return     The highest priority pending AESADV interrupt
 *
 *  @retval     One of @ref DL_AESADV_IIDX
 */
__STATIC_INLINE DL_AESADV_IIDX DL_AESADV_getPendingInterrupt(
    const AESADV_Regs *aesadv)
{
    return ((DL_AESADV_IIDX) aesadv->CPU_INT.IIDX);
}

